.config/doom/config.org
:PROPERTIES:
:header-args: :tangle ~/.config/doom/config.el
:END:
#+title: Literate Config
#+startup: fold
* Basic things
#+begin_src elisp
(setq user-full-name "Luis Camacho"
      user-mail-address "camacho.luis@protonmail.com")
#+end_src

I don't like custom.el >:(
#+begin_src elisp
(setq custom-file "/dev/null")
#+end_src
No element cache. Otherwise instant crash when parsing latex
#+begin_src elisp
(setq org-element-use-cache 't)
#+end_src
** Global Config
#+begin_src elisp
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
;(load! "lisp/lcp-theme")
(setq doom-theme 'doom-oceanic-next)
(setq doom-big-font t)
(setq doom-font (font-spec :family "CaskaydiaCove Nerd Font" :size 22 :weight 'regular)
     doom-variable-pitch-font (font-spec :family "CaskaydiaCove Nerd Font" :size 23));"FiraCode Nerd Font" :size 21))

(setq org-directory "~/org/")
(defvar lcp/org-support-directory "~/org/support/")
(setq org-noter-notes-search-path (list (concat lcp/org-support-directory "book-notes/")))
(setq org-attach-id-dir (concat lcp/org-support-directory "attach/"))

(setq display-line-numbers-type 'visual)
#+end_src

#+RESULTS:
: visual

** Global functions
#begin_src elisp
(global-tree-sitter-mode)
(add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode)
#+end_src

* Keybindings
#+begin_src elisp
(defun lcp/switch-input ()
  (interactive
  (unless (equal default-input-method "russian-computer")
    (set-input-method "russian-computer")
    (set-input-method "spanish-postfix"))))

(map! :leader
      "SPC" nil
      (:prefix-map ("r" . "org-roam")
        :desc "Find nodes" "f" #'lcp/org-roam-search
        :desc "Find nodes (only current)" "F" #'lcp/org-roam-search-current
        :desc "Find nodes (last dir)" "l" #'lcp/org-roam-search-last-dir
        :desc "Insert node" "i" #'org-roam-node-insert
        :desc "Check random node (last dir)" "r" #'lcp/org-roam-random-node-last-dir
        :desc "Check random node (select dir)" "R" #'lcp/org-roam-random-node
        :desc "Add to almanac" "a" #'lcp/org-roam-add-almanac
        :desc "UI mode" "U" #'org-roam-ui-mode
        :desc "UI open" "u" #'org-roam-ui-open)
      (:prefix-map ("j" . "miscellaneous")
        :desc "Citar open" "c" #'citar-open
        :desc "Cloze region" "z" #'anki-editor-cloze-region
        :desc "Switch input ru-es" "i" #'lcp/switch-input
        :desc "Multiple agenda view" "a" #'lcp/org-agenda-multiple-views
        :desc "Kill Ring" "y" #'yank-from-kill-ring
        :desc "Narrow" "n" #'org-toggle-narrow-to-subtree
        )
      (:prefix-map ("+" . "batch edit")
        :desc "iedit-mode" "i" #'iedit-mode
        :desc "vr/replace" "r" #'vr/replace
        :desc "vr/mc-mark" "c" #'vr/mc-mark
        :desc "query replace" "q" #'query-replace))

(map! :map outshine-mode-map "TAB" #'outshine-cycle)
#+end_src

#+RESULTS:

* UI
#+begin_src elisp
(set-frame-parameter nil 'alpha-background 95) ; For current frame
(add-to-list 'default-frame-alist '(alpha-background . 95)) ; For all new frames henceforth
(defun kb/toggle-window-transparency (arg)
  "Toggle the value of `alpha-background'.

Toggles between 100 and 72 by default.  Can choose which value to change
to if called with ARG, or any prefix argument."
  (interactive "P")
  (let ((transparency (pcase arg
                        ((pred numberp) arg)
                        ((pred car) (read-number "Change the transparency to which value (0-100)? "))
                        (_
                         (pcase (frame-parameter nil 'alpha-background)
                           (98 100)
                           (100 98)
                           (t 100))))))
    (set-frame-parameter nil 'alpha-background transparency)))
#+end_src

** Prettify symbols
Since I use this mainly to embellish my org-roam notes, I decided to add ~prettify-symbols-mode~ just for org-mode
#+begin_src elisp
(setq prettify-symbols-alist
      '(
       ("->" . →)
        ))
#+end_src
Later, if I see I could use it in more places, I'll make it so that the list changes depending on the extension
* org-mode
#+begin_src elisp :tangle ~/.config/doom/packages.el
;; FIXME Until no notice, I'll use this one
;; (package! org :pin "5890aca3d29e593640b728308096a052998355b1")
(package! org-drill)
(package! org-ref)
(package! org-roam-ui)
(package! org-transclusion)
(package! org-fragtog
  :recipe (:host github :repo "io12/org-fragtog"))
(package! org-roam-bibtex)
(package! org-chef)
(package! org-download)
(package! org-super-agenda)
#+end_src
** general
#+begin_src elisp
(after! org-mode
  (setq org-hide-emphasis-markers nil))
(require 'ob-julia)
(org-babel-do-load-languages
        'org-babel-load-languages
        '((R . t)
          (julia . t)
          (emacs-lisp . t)
          (gnuplot . t)
          (plantuml . t)))
#+end_src
#+begin_src elisp
(setq org-bullets-face-name (quote org-bullet-face))
(setq org-list-demote-modify-bullet '(("-" . "+")
                                      ("+" . "*")
                                      ("*" . "+")
                                      ("1." . "-")
                                      ("1)" . "-")
                                      ("a." . "+")
                                      ("a)" . "+")
                                      ("A." . "*")
                                      ("A)" . "*")
                                      ))
(setq org-bullets-bullet-list '("◎" "◉" "☉" "◌" "◦" "∙")) ;; ◍" "⊛" )
(setq org-babel-hide-markers-mode t)
(setq org-archive-default-command #'org-archive-to-archive-sibling)
(font-lock-add-keywords
 'org-mode
    '(("^ *\\([-]\\) "
       (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))
      ("^ *\\([+]\\) "
       (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "⮡"))))
      ("^ +\\([*]\\) "
       (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "◦"))))
      ))
#+end_src

#+RESULTS:

** org-journal
#+begin_src elisp
(setq calendar-week-start-day 1) ; Begin week on Monday
(setq calendar-date-style 'iso) ;american/european/is
#+end_src
#+begin_src elisp
(defun org-journal-file-header-func (time)
  "Custom function to create journal header."
  (concat
    (pcase org-journal-file-type
      ('daily "#+TITLE: Daily Journal\n#+STARTUP: showeverything")
      ('weekly "#+TITLE: Weekly Journal\n#+STARTUP: folded")
      ('monthly "#+TITLE: %B %Y Monthly Journal\n#+STARTUP: folded")
      ('yearly "#+TITLE: %Y Yearly Journal\n#+STARTUP: folded"))))

(setq org-timestamp-formats '("%Y-%m-%d" . "%Y-%m-%d %H:%M"))
(use-package! org-journal
  :init
  (setq org-journal-prefix-key "C-c n j")
  :custom
  ;(org-journal-tag-alist '("@sc23(s)" "@eeuu(e)" "@uni(u)" "@compsci(c)" "@best(b)" "@boston(o)"))
  (org-journal-dir (concat org-directory "journal/"))
  (org-journal-date-prefix "* ")
  (org-journal-date-format "%A, %d %B %Y")
  (org-journal-file-format "%Y-%m.org")
  (org-journal-carryover-items "")
  (org-journal-enable-agenda-integration nil)
  (org-journal-file-type 'monthly)
  (org-journal-file-header "#+TITLE: %B %Y Monthly Journal\n#+STARTUP: folded\n")) ;'org-journal-file-header-func))
(setq diary-file (concat org-journal-dir "dates.org"))
#+end_src

#+begin_src elisp
;; (defun jethro/tag-new-node-as-draft ()
;;   (org-roam-tag-add '("__draft__")))
;; (add-hook 'org-roam-capture-new-node-hook #'jethro/tag-new-node-as-draft)
#+end_src
** org-roam
#+begin_src elisp
;; (defmacro lcp/org-roam-template (letter name &optional class)
;;   `(,letter ,name plain "%?" :target

;;         (file+head ,(concat ,name "/${slug}.org" "#+title: ${title}\n" ,(if ,class (concat "#+latex_class: " ,class )) "\n#+startup: latexpreview"));#+filetags: :__draft__:\n")
;;           :jump-to-capture t
;;           :unnarrowed t))
;; (lcp/org-roam-template "ca" "artificial intelligence" "compsci")
#+end_src

#+begin_src elisp
(use-package! org-roam
  :ensure t
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-completion-everywhere t)
  (completion-ignore-case t)
  ;(org-roam-database-connector 'sqlite)
  (org-roam-directory (concat org-directory "roam/"))
  (org-roam-dailies-directory (concat org-roam-directory "diary/"))
  (org-roam-node-display-template
        (concat "${title:70}" (propertize "${tags:30}" 'face 'org-tag) "(" (propertize "${dir}" 'face 'org-tag) ") "))
  (org-roam-dailies-capture-templates
   '(

     ("d" "diary entry" plain "%?" :target
     (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n#+filetags: :daily:\n"))
     ;; ("d" "diary entry" plain "%?" :target
     ;;  (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n#+filetags: :daily:\n" ("Diary" "[%<%H:%M>]")))
     ))
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert)
         ("C-c n c" . org-roam-capture)
         ("C-c n g" . org-roam-graph)
         :map org-mode-map
         ("C-M-i"    . completion-at-point))
  :bind-keymap
  ("C-c n d" . org-roam-dailies-map)
  :config
  (org-roam-setup)
  (org-roam-db-autosync-mode)
  (require 'org-roam-dailies)
  )
#+end_src

#+RESULTS:
: completion-at-point

#+begin_src elisp
(defun  lcp/org-roam-add-almanac ()
  (interactive)
  (let ((node (org-roam-node-at-point 'assert))
        (almanac (seq-reduce #'(lambda (acc c)
                                   (string-replace c " " acc))
                               '("\n" "\t" "\"" "  ")
                               (read-from-minibuffer "Write to almanac: "))))
    (save-excursion
      (goto-char (org-roam-node-point node))
      (org-roam-property-add "ALMANAC" (concat "" almanac "")))))
#+end_src

#+RESULTS:
: lcp/org-roam-add-almanac

#+begin_src elisp
(cl-defmethod org-roam-node-dir ((node org-roam-node))
  "Return the TYPE of NODE."
  (let ((dir (file-name-directory
              (file-relative-name (org-roam-node-file node) org-roam-directory))))
   (if dir
       (directory-file-name dir)
     "*")))

(cl-defmethod org-roam-node-almanac ((node org-roam-node))
  "Return the TYPE of NODE."
  (let ((dir (file-name-directory
              (file-relative-name (org-roam-node-file node) org-roam-directory))))
   (if dir
       (directory-file-name dir)
     "*")))

(cl-defmethod org-roam-node-definition ((node org-roam-node))
  "Return the TYPE of NODE."
  (let ((dir (file-name-directory
              (file-relative-name (org-roam-node-file node) org-roam-directory))))
   (if dir
       (directory-file-name dir)
     "*")))
#+end_src

#+RESULTS:
: org-roam-node-definition
#+begin_src elisp
(load! "lisp/lcp-roam")
#+end_src

#+RESULTS:
: t

This snippet ([[https://gist.github.com/chayward1/c02116caf5251c5debd398268c5e1713][source]]) is really useful to exclude the nodes with the ":drill:" tag necessary for org-drill to work.
#+begin_src elisp
;; Exclude `org-drill' items from `org-roam'.
(require 'org-drill)
(setq org-roam-db-node-include-function
      (defun dotfiles/org-roam-include ()
        (and (not (member org-drill-question-tag (org-get-tags))))))

;; Don't forget to run the following commands!
;; M-x org-roam-db-clear-all
;; M-x org-roam-db-sync
#+end_src
#+begin_src elisp
(setq org-roam-capture-templates
  '(
    ("r" "roam" plain "%?" :target ; "didn't want to call it trivia"
    (file+head "${slug}.org" "#+title: ${title}\n#+startup: latexpreview\n");#+filetags: :__draft__:\n")
    :jump-to-capture t
    :unnarrowed t)
    ;; ("m" "math" plain "%?" :target
    ;; (file+head "math/${slug}.org" "#+title: ${title}\n#+latex_class: math\n#+startup: latexpreview");#+filetags: :__draft__:\n")
    ;; :jump-to-capture t
    ;; :unnarrowed t)
    ;; ("c" "compsci" plain "%?" :target
    ;; (file+head "compsci/${slug}.org" "#+title: ${title}\n#+latex_class: compsci\n#+startup: latexpreview");#+filetags: :__draft__:\n")
    ;; :jump-to-capture t
    ;; :unnarrowed t)

    ;; ("e" "essay") ; "miscellaneous with purpose"
    ;; ("ef" "fleeting" plain "%?" :target
    ;; (file+head "essay/fleeting/${slug}.org" "#+title: ${title}\n");#+filetags: :__draft__:\n")
    ;; :jump-to-capture t
    ;; :unnarrowed t)
    ;; ("ez" "zettelkasten" plain "%?" :target
    ;; (file+head "essay/zettelkasten/${slug}.org" "#+title: ${title}\n");#+filetags: :__draft__:\n")
    ;; :jump-to-capture t
    ;; :unnarrowed t)

    ;; ("t" "miscellaneous" plain "%?" :target ; "didn't want to call it trivia"
    ;; (file+head "miscellaneous/${slug}.org" "#+title: ${title}\n");#+filetags: :__draft__:\n")
    ;; :jump-to-capture t
    ;; :unnarrowed t)

    ;; ("s" "social science" plain "%?" :target
    ;; (file+head "social science/${slug}.org" "#+title: ${title}\n");#+filetags: :__draft__:\n")
    ;; :jump-to-capture t
    ;; :unnarrowed t)

    ;; ("i" "index and mind map" plain "%?" :target
    ;;  (file+head "index/${slug}.org" "#+title: ${title}\n");#+filetags: :__draft__:\n")
    ;;  :jump-to-capture t
    ;;  :unnarrowed t)

    ;; ("h" "health" plain "%?" :target
    ;;  (file+head "health/${slug}.org" "#+title: ${title}\n");#+filetags: :__draft__:\n")
    ;;  :jump-to-capture t
    ;;  :unnarrowed t)

    ;; ("a" "art")
    ;; ("aa" "anime & manga" plain "%?" :target
    ;; (file+head "art/anime/${slug}.org" "#+title: ${title}\n");#+filetags: :__draft__:\n")
    ;; :jump-to-capture t
    ;; :unnarrowed t)
    ;; ("al" "literature" plain "%?" :target
    ;; (file+head "art/literature/${slug}.org" "#+title: ${title}\n");#+filetags: :__draft__:\n")
    ;; :jump-to-capture t
    ;; :unnarrowed t)
    ;; ("ap" "painting & fine arts" plain "%?" :target
    ;; (file+head "art/fine arts/${slug}.org" "#+title: ${title}\n");#+filetags: :__draft__:\n")
    ;; :jump-to-capture t
    ;; :unnarrowed t)
    ;; ("ac" "cinematography" plain "%?" :target
    ;; (file+head "art/cinematography/${slug}.org" "#+title: ${title}\n");#+filetags: :__draft__:\n")
    ;; :jump-to-capture t
    ;; :unnarrowed t)
    ;; ("am" "music" plain "%?" :target
    ;; (file+head "art/music/${slug}.org" "#+title: ${title}\n")
    ;; :jump-to-capture t
    ;; :unnarrowed t)

    ;; ("l" "language")
    ;; ("lr" "русский" plain "%?" :target
    ;; (file+head "language/russkii/${slug}.org" "#+title: ${title}\n");#+filetags: :__draft__:\n")
    ;; :jump-to-capture t
    ;; :unnarrowed t)
    ;; ("lt" "türkçe" plain "%?" :target
    ;; (file+head "language/türkçe/${slug}.org" "#+title: ${title}\n");#+filetags: :__draft__:\n")
    ;; :jump-to-capture t
    ;; :unnarrowed t)
    ;; ("lf" "français" plain "%?" :target
    ;; (file+head "language/français/${slug}.org" "#+title: ${title}\n");#+filetags: :__draft__:\n")
    ;; :jump-to-capture t
    ;; :unnarrowed t)
    ;; ("ld" "deutsch" plain "%?" :target
    ;; (file+head "language/deutsch/${slug}.org" "#+title: ${title}\n");#+filetags: :__draft__:\n")
    ;; :jump-to-capture t
    ;; :unnarrowed t)
    ))
#+end_src

#+RESULTS:
| r | roam | plain | %? | :target | (file+head ${slug}.org #+title: ${title} |

** org-brain
#+begin_src elisp
(use-package! org-brain
  :custom
  (org-brain-title-max-length 90)
  (org-brain-exclude-tree-tag))
#+end_src
