.config/doom/packages.el
;; FIXME Until no notice, I'll use this one
;; (package! org :pin "5890aca3d29e593640b728308096a052998355b1")
(package! org-drill)
(package! org-ref)
(package! org-roam-ui)
(package! org-transclusion)
(package! org-fragtog
  :recipe (:host github :repo "io12/org-fragtog"))
(package! org-roam-bibtex)
(package! org-download)
(package! org-super-agenda)

(package! laas)
(package! auctex)
