.config/doom/config.org
*** [[https://orgmode.org/worg/org-tutorials/org-custom-agenda-commands.html][Custom commands]]
#+begin_src elisp
(setq org-agenda-custom-commands
      '(("c" "Cosas que hacer"
         ((agenda ""
                  ((org-habit-show-all-today 't)
                   (org-agenda-overriding-header "Routine")
                   (org-agenda-sorting-strategy
                    '(priority-down todo-state-up effort-up category-keep))))
          (tags-todo "-STYLE=\"habit\""
                     ((org-agenda-overriding-header "Objectives")
                      (org-super-agenda-groups
                       '((:name "Monthly objectives"
                          :tag "month")
                         (:discard (:tag "task"))
                         ))))
          (tags-todo "-STYLE=\"habit\"+task"
                     ((org-agenda-overriding-header "Pending tasks"))))
         ((org-agenda-span 1)
          (org-use-tag-inheritance 'nil)
          (org-agenda-dim-blocked-tasks nil)
          (org-agenda-remove-tags 't)
          (org-agenda-todo-ignore-timestamp 'nil)
          (org-agenda-todo-keyword-format "")
                      (org-agenda-use-time-grid 'nil)
          (org-agenda-todo-ignore-scheduled 'nil)
          (org-agenda-start-day "0d")
          (org-agenda-show-inherited-tags 'nil)
          (org-agenda-files (directory-files-recursively org-brain-path (rx ".org" eos)))))
       ("n" "Journal"
         (
          (agenda "" ((org-agenda-overriding-header "Previously...")
                      (org-agenda-start-day "-3d")
                      (org-agenda-span 3)))
          (agenda "" ((org-agenda-span 1)
                      (org-agenda-use-time-grid 't)
                      (org-agenda-todo-keyword-format "")
                      (org-agenda-deadline-leaders '("Deadline: " "%1d days left: " "%1d days ago: "))
                      (org-agenda-scheduled-leaders '("Scheduled: " "Day %1d: "))
                      (org-agenda-show-future-repeats 't)
                      (org-agenda-todo-ignore-scheduled 'org-agenda-span)
                      (org-agenda-start-day "0d")
                     (org-super-agenda-groups
                      '(
                        (:name ""
                         :time-grid 't
                         :transformer (--> it
                            (cond ((string-match ":daily:" it) (propertize it  'face '(:foreground "light sky blue")))
                                  ((string-match ":routine:" it) (propertize it  'face '(:foreground "pink")))
                                  ((string-match (car org-agenda-scheduled-leaders) it) (propertize it  'face '(:foreground "aquamarine")))
                                  ((string-match (car org-agenda-deadline-leaders) it) (propertize it  'face '(:foreground "orchid")))
                                (t (propertize it))) ; bottom case
                            (string-replace "::" ":" it)
                            )
                         )
                        (:name "Expired"
                         :order 8
                         :transformer (--> it
                            (propertize it 'face '(:foreground "orchid")))
                         :deadline today
                         :deadline past)
                        (:name "Ongoing tasks"
                         :order 10
                         :transformer (--> it
                            (propertize it 'face '(:foreground "aquamarine")))
                         ;"pale violet red""pale green"
                         :scheduled today
                         :and (:not (:deadline future)
                               :scheduled past))
                        (:name "Task with a deadline"
                         :order 9
                         :transformer (--> it
                            (propertize it 'face '(:foreground "navajo white")))
                         :deadline future)
                        (:name "Projects"
                         :order 12
                         :transformer (--> it
                            (propertize it 'face '(:foreground "navajo white")))
                         :tag "project")
                        ))
                      ))
          (agenda "" ((org-agenda-span 13)
                      (org-agenda-overriding-header "Coming up...")
                      (org-agenda-use-time-grid 'nil)
                      (org-agenda-todo-keyword-format "")
                      (org-agenda-show-future-repeats 't)
                      (org-agenda-start-day "+1d")
                      ))
          )
         nil
         ("~/org/calendar.ics"))
       ("m" "almanac"
         alltodo "" ((org-agenda-overriding-header "Almanac")
                     (org-agenda-dim-blocked-tasks nil)
                     (org-agenda-todo-keyword-format "%-1s")
                     (org-agenda-files (list (concat org-journal-dir "almanac.org")))
                     (org-agenda-remove-tags 'nil)
                     (org-agenda-show-inherited-tags 'nil)
                     (org-agenda-align-tags-to-column (- 10 (window-text-width)))
                     (org-super-agenda-unmatched-name "Miscellaneous")
                     (org-super-agenda-groups
                        '(
                          (:name "Topics to explore"
                           :order 10
                           :category "topic")
                          (:name "Recommendations"
                           :order 9
                           ;; :transformer (--> it
                           ;;    (propertize it 'face '(:foreground "navajo white")))
                           :category "recommendation")
                          (:name "Art"
                           :order 15
                           :category "art")
                          (:name "Ideas"
                           :order 12
                           :category "idea")
                          ))))
       ))
#+end_src

#+RESULTS:
| c | Cosas que hacer | ((agenda  ((org-habit-show-all-today 't) (org-agenda-overriding-header Routine) (org-agenda-sorting-strategy '(priority-down todo-state-up effort-up category-keep)))) (tags-todo -STYLE="habit" ((org-agenda-overriding-header Objectives) (org-super-agenda-groups '((:name Monthly objectives :tag month) (:discard (:tag task)))))) (tags-todo -STYLE="habit"+task ((org-agenda-overriding-header Pending tasks))))                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    | ((org-agenda-span 1) (org-use-tag-inheritance 'nil) (org-agenda-dim-blocked-tasks nil) (org-agenda-remove-tags 't) (org-agenda-todo-ignore-timestamp 'nil) (org-agenda-todo-keyword-format ) (org-agenda-use-time-grid 'nil) (org-agenda-todo-ignore-scheduled 'nil) (org-agenda-start-day 0d) (org-agenda-show-inherited-tags 'nil) (org-agenda-files (directory-files-recursively org-brain-path (rx .org eos)))) |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
| n | Journal         | ((agenda  ((org-agenda-overriding-header Previously...) (org-agenda-start-day -3d) (org-agenda-span 3))) (agenda  ((org-agenda-span 1) (org-agenda-use-time-grid 't) (org-agenda-todo-keyword-format ) (org-agenda-deadline-leaders '(Deadline:  %1d days left:  %1d days ago: )) (org-agenda-scheduled-leaders '(Scheduled:  Day %1d: )) (org-agenda-show-future-repeats 't) (org-agenda-todo-ignore-scheduled 'org-agenda-span) (org-agenda-start-day 0d) (org-super-agenda-groups '((:name  :time-grid 't :transformer (--> it (cond ((string-match :daily: it) (propertize it 'face '(:foreground light sky blue))) ((string-match :routine: it) (propertize it 'face '(:foreground pink))) ((string-match (car org-agenda-scheduled-leaders) it) (propertize it 'face '(:foreground aquamarine))) ((string-match (car org-agenda-deadline-leaders) it) (propertize it 'face '(:foreground orchid))) (t (propertize it))) (string-replace :: : it))) (:name Expired :order 8 :transformer (--> it (propertize it 'face '(:foreground orchid))) :deadline today :deadline past) (:name Ongoing tasks :order 10 :transformer (--> it (propertize it 'face '(:foreground aquamarine))) :scheduled today :and (:not (:deadline future) :scheduled past)) (:name Task with a deadline :order 9 :transformer (--> it (propertize it 'face '(:foreground navajo white))) :deadline future) (:name Projects :order 12 :transformer (--> it (propertize it 'face '(:foreground navajo white))) :tag project))))) (agenda  ((org-agenda-span 13) (org-agenda-overriding-header Coming up...) (org-agenda-use-time-grid 'nil) (org-agenda-todo-keyword-format ) (org-agenda-show-future-repeats 't) (org-agenda-start-day +1d)))) | nil                                                                                                                                                                                                                                                                                                                                                                                                                 | (~/org/calendar.ics)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |
| m | almanac         | alltodo                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |                                                                                                                                                                                                                                                                                                                                                                                                                     | ((org-agenda-overriding-header Almanac) (org-agenda-dim-blocked-tasks nil) (org-agenda-todo-keyword-format %-1s) (org-agenda-files (list (concat org-journal-dir almanac.org))) (org-agenda-remove-tags 'nil) (org-agenda-show-inherited-tags 'nil) (org-agenda-align-tags-to-column (- 10 (window-text-width))) (org-super-agenda-unmatched-name Miscellaneous) (org-super-agenda-groups '((:name Topics to explore :order 10 :category topic) (:name Recommendations :order 9 :category recommendation) (:name Art :order 15 :category art) (:name Ideas :order 12 :category idea)))) |

*** Change color by tag
#+begin_src elisp
(set-face-attribute 'org-agenda-dimmed-todo-face nil
                    :weight 'ultra-bold
                    :inverse-video 't
                    :slant 'reverse-italic)
;(defvar lcp--tag-color-cons-alist)
;; (defun lcp--org-agenda-tag-color ()

;;   "This function changes the entry's foreground color depending on the tags depending of what is specified"
;;   )
;; (add-hook 'org-mode-hook
;;           (lambda ()
;;             (font-lock-add-keywords
;;              'org-mode
             ;; '(
             ;;   ("^.*:#deutsch:.*$" 0 '(:foreground "#FF6347") t)
             ;;   ("^.*:#eeuu:.*$" 0 '(:foreground "#5CACEE") t)
             ;;   ("^.*:#uni:.*$" 0 '(:foreground "#FF82AB") t)
             ;;   ("^.*:#health:.*$" 0 '(:foreground "#54FF9F") t)
             ;;   ;("^.*:#hiking:.*$" 0 '(:foreground "#FF8247") t)
             ;;   ("^.*:#compsci:.*$" 0 '(:foreground "#FF83FA") t)
             ;;   ("^.*:#russki:.*$" 0 '(:foreground "#97FFFF") t)
             ;;   ("^.*:#gamedev:.*$" 0 '(:foreground "#FFE4E1") t)
             ;;   )
;)))

;#'lcp--org-agenda-tag-color)
#+end_src

#+RESULTS:

#+begin_src elisp
;; (setq org-tag-faces
;; '(
;;   ("#deutsch" . '(:foreground "#FF6347"))
;;   ("#eeuu" . '(:foreground "#5CACEE"))
;;   ("#uni" . '(:foreground "#FF82AB"))
;;   ("#health" . '(:foreground "#54FF9F"))
;;   ;("#hiking" . '(:foreground "#FF8247"))
;;   ("#compsci" . '(:foreground "#FF83FA"))
;;   ("#russki" . '(:foreground "#97FFFF"))
;;   ("#gamedev" . '(:foreground "#FFE4E1"))
;;   ))
#+end_src
