.config/doom/config.org
*** Multiple agendas at the same time
#+begin_src elisp
;; NOTE STICKY AGENDAS MUST BE ENABLED
(setq org-agenda-sticky 't)
(defvar lcp/pre-agenda-frame-configuration nil)

(defun lcp/org-agenda-quit ()
  (interactive)
  (org-agenda-quit)
  (if lcp/pre-agenda-frame-configuration
    (set-frame-configuration lcp/pre-agenda-frame-configuration))
  (setq lcp/pre-agenda-frame-configuration nil))

;; NOTE UPDATE EVERYTIME YOU WANT A NEW VIEW
(defun lcp/org-agenda-multiple-views (&optional arg arg2 arg3)
  (interactive "p")
  (setq lcp/pre-agenda-frame-configuration (current-frame-configuration))
  (org-agenda arg2 "i")
  (org-agenda-redo)
  (split-window-right)
  (org-agenda arg "n")
  (org-agenda-redo)
  (other-window 1)
  (split-window-right)
  (org-agenda arg3 "o")
  (org-agenda-redo)
  ;(split-window-below)
  )
(define-key org-super-agenda-header-map "q" 'lcp/org-agenda-quit)
(define-key org-super-agenda-header-map "j" 'org-agenda-next-item)
(define-key org-super-agenda-header-map "k" 'org-agenda-previous-item)
(define-key org-agenda-mode-map "j" 'org-agenda-next-item)
(define-key org-agenda-mode-map "k" 'org-agenda-previous-item)
(define-key org-agenda-mode-map "q" 'lcp/org-agenda-quit)
(define-key org-agenda-keymap "j" 'org-agenda-next-item)
(define-key org-agenda-keymap "k" 'org-agenda-previous-item)
(define-key org-agenda-keymap "q" 'lcp/org-agenda-quit)
#+end_src

** org-ref
#+begin_src elisp
(use-package! org-ref
    :custom
    bibtex-completion-bibliography (directory-files citar-biblio-dir t directory-files-no-dot-files-regexp))
    bibtex-completion-library-path '("~/org/roam/bib/")
    bibtex-completion-notes-path "~/org/roam/references/"
    bibtex-completion-notes-template-multiple-files "* ${author-or-editor}, ${title}, ${journal}, (${year}) :${=type=}: \n\nSee [[cite:&${=key=}]]\n"
    bibtex-completion-additional-search-fields '(keywords)
    bibtex-completion-display-formats
    '((article       . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${journal:40}")
      (inbook        . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} Chapter ${chapter:32}")
      (incollection  . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
      (inproceedings . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
      (t             . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}"))
#+end_src

** org-capture
#+begin_src elisp
(defvar org-journal--date-location-scheduled-time nil)

(defun org-journal-date-location (&optional scheduled-time)
  (let ((scheduled-time (or scheduled-time (org-read-date nil nil nil "Date:"))))
    (setq org-journal--date-location-scheduled-time scheduled-time)
    (org-journal-new-entry t (org-time-string-to-time scheduled-time))
    ;; (unless (eq org-journal-file-type 'daily)
    ;;   (org-narrow-to-subtree))
    (goto-char (point-max))))

(print (mapconcat #'(lambda (x) (format "|%s" x)) lcp/category-names))
#+end_src

#+begin_src elisp
(setq! org-capture-templates
       '(("a" "Almanac")
         ("ar" "Recommendation" entry (id "a1cad34d-4cd2-4416-9200-4878522b37ab")
          "** %^{Recommendation}  %^g\n%?")
         ("at" "Investigate" entry (id "d7051ed9-6843-4e11-abf2-5c9643e23429")
          "** %^{Topic}\n%?")
         ("af" "Offers" entry (id "c7ff48c9-ba5b-4a05-85f6-13d03a60bca1")
          "** %^{Name of the company}\n:PROPERTIES:\n:WEBSITE: %^{Where can I get info about the offers}\n:END:\n%?"
          :prepend t
          :jump-to-captured t)
         ("ai" "Idea" entry (id "5d5dc252-6686-4ab6-8471-cde9d47c053e")
          "** %^{Name of idea} \n%?")

         ("j" "Journal entry")
         ("jj" "Plain" entry (file+olp+datetree "journal.org")
          "* TODO %? %^g\n%T"
          :tree-type month
          :time-prompt t)
         ("js" "Scheduled" entry (file+olp+datetree "journal.org")
          "* TODO %? %^g\nSCHEDULED: %T"
          :tree-type month
          :time-prompt t)
         ("jd" "Deadline" entry (file+olp+datetree "journal.org")
          "* TODO %? %^g\nDEADLINE: %T"
          :tree-type month
          :time-prompt t)))
#+end_src

#+RESULTS:

** org-chef
#+begin_src elisp
(use-package! org-chef)

;; (defun lcp/org-chef-add-to-roam
;;     )
#+end_src
** org-fragtog
#+begin_src elisp
(use-package! org-fragtog
  :after org
  :hook (org-mode . org-fragtog-mode))
#+end_src
** org-latex
#+begin_src elisp
(defun my/text-scale-adjust-latex-previews ()
  "Adjust the size of latex preview fragments when changing the
buffer's text scale."
  (pcase major-mode
    ('latex-mode
     (dolist (ov (overlays-in (point-min) (point-max)))
       (if (eq (overlay-get ov 'category)
               'preview-overlay)
           (my/text-scale--resize-fragment ov))))
    ('org-mode
     (dolist (ov (overlays-in (point-min) (point-max)))
       (if (eq (overlay-get ov 'org-overlay-type)
               'org-latex-overlay)
           (my/text-scale--resize-fragment ov))))))

(defun my/text-scale--resize-fragment (ov)
  (overlay-put
   ov 'display
   (cons 'image
         (plist-put
          (cdr (overlay-get ov 'display))
          :scale (+ 1.0 (* 0.25 text-scale-mode-amount))))))

(add-hook 'text-scale-mode-hook #'my/text-scale-adjust-latex-previews)

(after! org
  (use-package! ox-extra
    :config
    (ox-extras-activate '(latex-header-blocks ignore-headlines))))
#+end_src

#+RESULTS:
: t

*** Custom classes
#+begin_src elisp
(setq org-latex-default-class "math")
(setq! org-latex-classes
       '(
         ("math"
          "\\documentclass[11pt, a4paper, parskip=5em, parindent=0em]{article}
[DEFAULT-PACKAGES]
\\usepackage{tikz}
\\usepackage{algorithm}
\\usepackage{algpseudocode}

\\usepackage{amsthm}
\\newtheorem{theorem}{Theorem}[section]
\\newtheorem{lemma}[thm]{Lemma}
\\newtheorem{corollary}[thm]{Corollary}
\\newtheorem{proposition}[thm]{Proposition}
\\theoremstyle{definition}
\\newtheorem{definition}{Definition}[section]

\\newenvironment{rcases} {\\left.\\begin{aligned}} {\\end{aligned}\\right\\rbrace}
\\newenvironment{lcases} {\\left\\lbrace\\begin{aligned}} {\\end{aligned}}
"
          ("\\section{%s}" . "\\section*{%s}")
          ("\\subsection{%s}" . "\\subsection*{%s}")
          ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
          ("\\paragraph{%s}" . "\\paragraph*{%s}")
          ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))

         ("article" "\\documentclass[11pt]{article}"
          ("\\section{%s}" . "\\section*{%s}")
          ("\\subsection{%s}" . "\\subsection*{%s}")
          ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
          ("\\paragraph{%s}" . "\\paragraph*{%s}")
          ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))

         ("report" "\\documentclass[11pt]{report}"
          ("\\part{%s}" . "\\part*{%s}")
          ("\\chapter{%s}" . "\\chapter*{%s}")
          ("\\section{%s}" . "\\section*{%s}")
          ("\\subsection{%s}" . "\\subsection*{%s}")
          ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))

         ("book" "\\documentclass[11pt]{book}"
          ("\\part{%s}" . "\\part*{%s}")
          ("\\chapter{%s}" . "\\chapter*{%s}")
          ("\\section{%s}" . "\\section*{%s}")
          ("\\subsection{%s}" . "\\subsection*{%s}")
          ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))
         ))
#+end_src

#+RESULTS:

** org-transclusion
#+begin_src elisp
(use-package! org-transclusion
  :after org
  :init
  (map!
   :leader
   :prefix "n"
   (:prefix-map ("t" . "transclusion")
        :desc "Remove transclusion" "d" #'org-transclusion-remove
        :desc "Remove all transclusions" "D" #'org-transclusion-remove-all
        :desc "Add transclusion" "a" #'org-transclusion-add
        :desc "Add all transclusions" "A" #'org-transclusion-add-all
        :desc "Refresh" "r" #'org-transclusion-refresh
        :desc "Move to source" "s" #'org-transclusion-move-to-source
        :desc "Transclusion mode" "t" #'org-transclusion-mode
        (:prefix-map ("l" . "live-sync")
             :desc "Start" "s" #'org-transclusion-live-sync-start
             :desc "Exit" "e" #'org-transclusion-live-sync-exit))))
#+end_src

* LaTeX
#+begin_src elisp :tangle ~/.config/doom/packages.el
(package! laas)
(package! auctex)
#+end_src

** laas
#+begin_src elisp
;; (setq org-latex-listings 'minted
;;       org-latex-pdf-process
;;       '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
;;         "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))

(add-to-list 'org-latex-packages-alist '("" "tikz" t))
(require 'ox-latex)
;; (add-to-list 'org-latex-packages-alist '("" "minted"))
(eval-after-load "preview"
  '(add-to-list 'preview-default-preamble
  "\\PreviewEnvironment{tikzpicture}" t))
(setq org-preview-latex-default-process 'dvisvgm)
#+end_src

https://www.overleaf.com/learn/latex/Using_colors_in_LaTeX
#+begin_src elisp
(use-package! laas
  :hook (LaTeX-mode . laas-mode)
        (org-mode . laas-mode)
  :config ; do whatever here
    (aas-set-snippets 'laas-mode
        :cond #'texmathp ; expand only while in math
        "On" "O(n)"
        "O1" "O(1)"
        "Olog" "O(\\log n)"
        "Olon" "O(n \\log n)"

        "sum" (lambda () (interactive)
                (yas-expand-snippet "\\sum_{$1}^{$2} $0"))
        "color" (lambda () (interactive)
                (yas-expand-snippet "\\color{$0}"))

        :cond #'laas-object-on-left-condition
        "'q" (lambda () (interactive) (laas-wrap-previous-object "sqrt"))
        "'t" (lambda () (interactive) (laas-wrap-previous-object "text"))
        "'B" (lambda () (interactive) (laas-wrap-previous-object "mathbf"))
        "'b" (lambda () (interactive) (laas-wrap-previous-object "mathbb"))
        "'CC" (lambda () (interactive) (laas-wrap-previous-object "textcolor{}"))
        "'Cb" (lambda () (interactive) (laas-wrap-previous-object "textcolor{blue}"))
        "'CB" (lambda () (interactive) (laas-wrap-previous-object "textcolor{brown}"))
        "'Cr" (lambda () (interactive) (laas-wrap-previous-object "textcolor{red}"))
        "'Cg" (lambda () (interactive) (laas-wrap-previous-object "textcolor{green}"))
        "'Cm" (lambda () (interactive) (laas-wrap-previous-object "textcolor{magenta}"))
        "'Cc" (lambda () (interactive) (laas-wrap-previous-object "textcolor{cyan}"))
        "'Cy" (lambda () (interactive) (laas-wrap-previous-object "textcolor{yellow}"))
        )
  :custom
  (laas-basic-snippets
     '(:cond laas-mathp
       "!="    "\\neq"
       "!>"    "\\mapsto"
       "**"    "\\cdot"
       "+-"    "\\pm"
       "-+"    "\\mp"
       "->"    "\\to"
       "..."   "\\dots"
       "<< "    "\\ll"
       "<= "    "\\leq"
       "<>"    "\\diamond"
       "==<"    "\\impliedby"
       "== "    "&="
       "==>"    "\\implies" "=> " "\\Rightarrow" "<==" "\\Leftarrow"
       ">= "    "\\geq" "<=>" "\\Leftrightarrow"
       ">>  "    "\\gg"
       "AA"    "\\forall"
       "EE"    "\\exists"
       "cb"    "^3"
       "iff"   "\\iff"
       "inn"   "\\in"
       "notin" "\\not\\in"
       "sr"    "^2"
       "xx"    "\\times"
       "|->"   "\\mapsto"
       "|="    "\\models"
       "||"    "\\mid"
       "~="    "\\approx"
       "~~"    "\\sim"
       "[ ]"   "\square"
       "sqrt"  "\\sqrt"

       "arccos" "\\arccos"
       "arccot" "\\arccot"
       "arccot" "\\arccot"
       "arccsc" "\\arccsc"
       "arcsec" "\\arcsec"
       "arcsin" "\\arcsin"
       "arctan" "\\arctan"
       "cos"    "\\cos"
       "cot"    "\\cot"
       "csc"    "\\csc"
       "exp"    "\\exp"
       "ln"     "\\ln"
       "log"    "\\log"
       "perp"   "\\perp"
       "sin"    "\\sin"
       "star"   "\\star"
       "gcd"    "\\gcd"
       "min"    "\\min"
       "max"    "\\max"

       ";.N"  "\\mathbb{N}"
       ";.C"  "\\mathbb{C}"
       ";.R"  "\\mathbb{R}"
       ";.Q"  "\\mathbb{Q}"
       ";.Z"  "\\mathbb{Z}"

       ";a"  "\\alpha"
       ";A"  "\\forall"        ";;A" "\\aleph"
       ";b"  "\\beta "
                        ";;;C" "\\arccos"
       ";d"  "\\dot"         ";;d" "\\partial"
       ";D"  "\\Delta"         ";;D" "\\nabla"
       ";e"  "\\mathcal{E}"       ";;e" "\\varepsilon"   ";;;e" "\\exp"
       ";E"  "\\exists"                               ";;;E" "\\ln"
       ";f"  "\\phi"           ";;f" "\\varphi"
       ";F"  "\\Phi"
       ";g"  "\\gamma"                                ";;;g" "\\lg"
       ";G"  "\\Gamma"                                ";;;G" "10^{?}"
       ";h"  "\\eta"           ";;h" "\\hbar"
       ";i"  "\\infty"            ";;i" "\\imath"
       ";I"  "\\in"          ";;I" "\\Im"
       ";;j" "\\jmath"
       ";k"  "\\kappa"
       ";l"  "\\mathcal{L}"        ";;l" "\\ell"          ";;;l" "\\log"
       ";L"  "\\Lambda"
       ";m"  "\\mu"
       ";n"  "\\nabla"         ";;n" "\\vec{\\nabla}"     ";;;n" "\\ln"

       ";o"  "\\omega"         ";;o" "\\circ"
       ";O"  "\\Omega"         ";;O" "\\mho"
       ";p"  "\\partial"            ";;p" "\\varpi"
       ";P"  "\\Pi"
       ";q"  "\\theta"         ";;q" "\\vartheta"

       ";r"  "\\rho"           ";;r" "\\varrho"
       ";;R" "\\Re"
       ";s"  "\\sqrt"         ";;s" "\\varsigma"    ";;;s" "\\sin"
       ";S"  "\\Sigma"                               ";;;S" "\\arcsin"
       ";t"  "\\tau"                                 ";;;t" "\\tan"
       ";;;T" "\\arctan"
       ";u"  "\\upsilon"
       ";U"  "\\Upsilon"
       ";v"  "\\vec"          ";;v" "\\land"         ";;;v" "\\lor"
       ";V"  "\\Phi"
       ";w"  "\\xi"
       ";W"  "\\Xi"
       ";x"  "\\chi"
       ";y"  "\\psi"
       ";Y"  "\\Psi"
       ";z"  "\\zeta"

       ";0"  "\\emptyset"
       ";8"  "\\infty"
       ";!"  "\\neg"
       ";^"  "\\uparrow"
       ";&"  "\\wedge"
       ";~"  "\\approx"        ";;~" "\\simeq"
       ";_"  "\\downarrow"
       ";+"  "\\cup"
       ";-"  "\\leftrightarrow"";;-" "\\longleftrightarrow"
       ";*"  "\\times"
       ";/"  "\\not"
       ";|"  "\\mapsto"        ";;|" "\\longmapsto"
       ";\\" "\\setminus"
       ";="  "\\Leftrightarrow"";;=" "\\Longleftrightarrow"
       ";(" "\\langle"
       ";)" "\\rangle"
       ";[" "\\Leftarrow"     ";;[" "\\Longleftarrow"
       ";]" "\\Rightarrow"    ";;]" "\\Longrightarrow"
       ";{"  "\\subset"
       ";}"  "\\supset"
       ";<"  "\\leftarrow"    ";;<" "\\longleftarrow"  ";;;<" "\\min"
       ";>"  "\\rightarrow"   ";;>" "\\longrightarrow" ";;;>" "\\max"

       ";'"  "\\prime"))
  )
#+end_src

#+RESULTS:
| er/add-org-mode-expansions | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | laas-mode | org-fragtog-mode | org-ref-org-menu | +lookup--init-org-mode-handlers-h | (closure (t) (&rest _) (add-hook 'before-save-hook 'org-encrypt-entries nil t)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | doom-disable-show-paren-mode-h | doom-disable-show-trailing-whitespace-h | +org-make-last-point-visible-h | evil-org-mode | toc-org-enable | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | embrace-org-mode-hook |

