.config/doom/config.org
* LSP
#+begin_src elisp :tangle ~/.config/doom/packages.el
(package! lsp-pyright
  :recipe (:host github :repo "emacs-lsp/lsp-pyright"))
(package! lsp-haskell)
(package! lsp-dart)
#+end_src

#+begin_src elisp
(use-package! lsp-pyright
  :ensure t
  :hook (python-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp))))
(add-hook 'c-mode-hook 'lsp)
(add-hook 'c++-mode-hook 'lsp)
(add-hook 'c++-mode-hook 'lsp)
(add-hook 'dart-mode-hook 'lsp)
(add-to-list 'exec-path (concat doom-user-dir "lsps/elixir/"))
;(add-hook 'go-mode-hook 'eglot-ensure)
(add-hook 'haskell-mode-hook #'lsp)
(add-hook 'haskell-literate-mode-hook #'lsp)
(setq lsp-dart-flutter-sdk-dir "/home/luis/snap/flutter/common/flutter/")
(setq lsp-dart-sdk-dir (concat lsp-dart-flutter-sdk-dir "bin/cache/dart-sdk/"))
(setq dart-server-enable-analysis-server t)

;(add-to-list 'auto-mode-alist '("\\.tsx\\'" . js-jsx-mode))
;(setq lsp-beancount-langserver-executable "~/.cargo/bin/beancount-language-server")
;(setq lsp-beancount-journal-file "cargo/bin/beancount-language-server")
#+end_src

#+RESULTS:
: t

#+begin_src elisp
(setq treesit-language-source-alist
   '((bash "https://github.com/tree-sitter/tree-sitter-bash")
     (cmake "https://github.com/uyha/tree-sitter-cmake")
     (css "https://github.com/tree-sitter/tree-sitter-css")
     (elisp "https://github.com/Wilfred/tree-sitter-elisp")
     (elixir "https://github.com/elixir-lang/tree-sitter-elixir")
     (go "https://github.com/tree-sitter/tree-sitter-go")
     (html "https://github.com/tree-sitter/tree-sitter-html")
     (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
     (json "https://github.com/tree-sitter/tree-sitter-json")
     (make "https://github.com/alemuller/tree-sitter-make")
     (markdown "https://github.com/ikatyang/tree-sitter-markdown")
     (python "https://github.com/tree-sitter/tree-sitter-python")
     (toml "https://github.com/tree-sitter/tree-sitter-toml")
     (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
     (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
     (yaml "https://github.com/ikatyang/tree-sitter-yaml")))
#+end_src

#+RESULTS:
| bash       | https://github.com/tree-sitter/tree-sitter-bash       |        |                |
| cmake      | https://github.com/uyha/tree-sitter-cmake             |        |                |
| css        | https://github.com/tree-sitter/tree-sitter-css        |        |                |
| elisp      | https://github.com/Wilfred/tree-sitter-elisp          |        |                |
| elixir     | https://github.com/elixir-lang/tree-sitter-elixir     |        |                |
| go         | https://github.com/tree-sitter/tree-sitter-go         |        |                |
| html       | https://github.com/tree-sitter/tree-sitter-html       |        |                |
| javascript | https://github.com/tree-sitter/tree-sitter-javascript | master | src            |
| json       | https://github.com/tree-sitter/tree-sitter-json       |        |                |
| make       | https://github.com/alemuller/tree-sitter-make         |        |                |
| markdown   | https://github.com/ikatyang/tree-sitter-markdown      |        |                |
| python     | https://github.com/tree-sitter/tree-sitter-python     |        |                |
| toml       | https://github.com/tree-sitter/tree-sitter-toml       |        |                |
| tsx        | https://github.com/tree-sitter/tree-sitter-typescript | master | tsx/src        |
| typescript | https://github.com/tree-sitter/tree-sitter-typescript | master | typescript/src |
| yaml       | https://github.com/ikatyang/tree-sitter-yaml          |        |                |

* Miscellaneous
#+begin_src elisp :tangle ~/.config/doom/packages.el
(package! gnuplot-mode)
(package! bqn-mode)
(package! load-theme-buffer-local)
(package! calibredb)
(package! visual-regexp)
(package! chess)
(package! speed-type)
(package! nov)
(package! doct)
(package! hledger-mode)
(package! svelte-mode)
(package! svelte-mode)
(package! dirvish)
(package! all-the-icons)
(package! riscv-mode)
(package! anki-editor)
(package! wakatime-mode)
(package! outshine
  :recipe (:host github :repo "alphapapa/outshine"))
(package! sparql
  :recipe (:host github :repo "ljos/sparql-mode"))
#+end_src
** anki-editor
#+begin_src elisp
(use-package! anki-editor)
  ;:hook (org-mode . anki-editor-mode))
#+end_src
** hl-todo
#+begin_src elisp
;; IMPROVE Asignar colores según función
(after! hl-todo
    (setq hl-todo-keyword-faces
        '(
        ("TODO" . "#fe6323")
        ("DONE" . "#ff889f")
        ("DONT" . "#f0f040")
        ("HOLD" . "#f0ff8f")
        ("NEXT" . "#1ca3a3")
        ("PROG" . "#7cb8bb")
        ("OKAY" . "#7cf8bb")
        ("FAIL" . "#8c5353")
        ("FIXME"  . "#ff0000")
        ("FIXING"  . "#bff302")
        ("FIXED"  . "#ff33b3")
        ("REMOVE"  . "#909ff3")
        ("DEBUG"  . "#1f9333")
        ("IMPROVE" . "#7040f1")
        ("NOTE"   . "#2fc100")
        ("KLUDGE" . "#d0bf8f")
        ("HACK"   . "#900f9f")
        ("TEMP"   . "#308f8f")
        ("XXX"  . "#cc9393"))))
#+end_src

** hledger
#+begin_src elisp
;; (use-package! hledger-mode
;;   :custom
;;   (hledger-jfile (concat org-directory "hledger.journal")))

(add-to-list 'auto-mode-alist '("\\.journal$" . ledger-mode))
(add-to-list 'ledger-mode-hook 'outshine-mode)
(setq ledger-default-date-format "%Y-%m-%d")

(map! :map ledger-mode-map "TAB" #'outshine-cycle)
#+end_src
** all-the-icons
#+begin_src elisp
(use-package all-the-icons
  :if (display-graphic-p))
#+end_src
** calibredb
#+begin_src elisp
(use-package! calibredb
  :defer t
  :bind
  ("C-c c" . calibredb)
  :config
  (setq calibredb-root-dir "~/Calibre Library")
  (setq calibredb-db-dir (expand-file-name "metadata.db" calibredb-root-dir))
  (setq calibredb-library-alist '(("~/Documents/Libraries/Computer Science", "~/Documents/Libraries/Mathematics", "~/Documents/Libraries/Selección")))
  (setq calibredb-virtual-library-alist '(("1. University" . "@university")
                                          ("2. Copywork" . "@copywork")
                                          ("3. To Read" . "@toread epub")
                                          ("4. Interesting Information" . "@investigate")
                                          ("5. Language Learning" . "\\(@english\\|@deutsch\\)"))))
#+end_src
*** Keybindings
#+begin_src elisp
(defvar calibredb-show-mode-map
  (let ((map (make-sparse-keymap)))
    (define-key map "?" #'calibredb-entry-dispatch)
    (define-key map "l" #'calibredb-virtual-library-list)
    (define-key map "L" #'calibredb-library-list)
    (define-key map "n" #'calibredb-virtual-library-next)
    (define-key map "N" #'calibredb-library-next)
    (define-key map "p" #'calibredb-virtual-library-previous)
    (define-key map "P" #'calibredb-library-previous)
    (define-key map "o" #'calibredb-find-file)
    (define-key map "O" #'calibredb-find-file-other-frame)
    (define-key map "V" #'calibredb-open-file-with-default-tool)
    (define-key map "s" #'calibredb-set-metadata-dispatch)
    (define-key map "e" #'calibredb-export-dispatch)
    (define-key map "q" #'calibredb-entry-quit)
    (define-key map "y" #'calibredb-yank-dispatch)
    (define-key map "," #'calibredb-quick-look)
    (define-key map "." #'calibredb-open-dired)
    (define-key map "\M-/" #'calibredb-rga)
    (define-key map "\M-t" #'calibredb-set-metadata--tags)
    (define-key map "\M-a" #'calibredb-set-metadata--author_sort)
    (define-key map "\M-A" #'calibredb-set-metadata--authors)
    (define-key map "\M-T" #'calibredb-set-metadata--title)
    (define-key map "\M-c" #'calibredb-set-metadata--comments)
    map)
  "Keymap for `calibredb-show-mode'.")
(defvar calibredb-search-mode-map
  (let ((map (make-sparse-keymap)))
    (define-key map [mouse-3] #'calibredb-search-mouse)
    (define-key map (kbd "<RET>") #'calibredb-find-file)
    (define-key map "?" #'calibredb-dispatch)
    (define-key map "a" #'calibredb-add)
    (define-key map "A" #'calibredb-add-dir)
    (define-key map "c" #'calibredb-clone)
    (define-key map "d" #'calibredb-remove)
    (define-key map "D" #'calibredb-remove-marked-items)
    (define-key map "j" #'calibredb-next-entry)
    (define-key map "k" #'calibredb-previous-entry)
    (define-key map "l" #'calibredb-virtual-library-list)
    (define-key map "L" #'calibredb-library-list)
    (define-key map "n" #'calibredb-virtual-library-next)
    (define-key map "N" #'calibredb-library-next)
    (define-key map "p" #'calibredb-virtual-library-previous)
    (define-key map "P" #'calibredb-library-previous)
    (define-key map "s" #'calibredb-set-metadata-dispatch)
    (define-key map "S" #'calibredb-switch-library)
    (define-key map "o" #'calibredb-find-file)
    (define-key map "O" #'calibredb-find-file-other-frame)
    (define-key map "v" #'calibredb-view)
    (define-key map "V" #'calibredb-open-file-with-default-tool)
    (define-key map "," #'calibredb-quick-look)
    (define-key map "." #'calibredb-open-dired)
    (define-key map "y" #'calibredb-yank-dispatch)
    (define-key map "b" #'calibredb-catalog-bib-dispatch)
    (define-key map "e" #'calibredb-export-dispatch)
    (define-key map "r" #'calibredb-search-refresh-and-clear-filter)
    (define-key map "R" #'calibredb-search-clear-filter)
    (define-key map "q" #'calibredb-search-quit)
    (define-key map "m" #'calibredb-mark-and-forward)
    (define-key map "f" #'calibredb-toggle-favorite-at-point)
    (define-key map "x" #'calibredb-toggle-archive-at-point)
    (define-key map "h" #'calibredb-toggle-highlight-at-point)
    (define-key map "u" #'calibredb-unmark-and-forward)
    (define-key map "i" #'calibredb-edit-annotation)
    (define-key map (kbd "<DEL>") #'calibredb-unmark-and-backward)
    (define-key map (kbd "<backtab>") #'calibredb-toggle-view)
    (define-key map (kbd "TAB") #'calibredb-toggle-view-at-point)
    (define-key map "\M-n" #'calibredb-show-next-entry)
    (define-key map "\M-p" #'calibredb-show-previous-entry)
    (define-key map "/" #'calibredb-search-live-filter)
    (define-key map "\M-t" #'calibredb-set-metadata--tags)
    (define-key map "\M-a" #'calibredb-set-metadata--author_sort)
    (define-key map "\M-A" #'calibredb-set-metadata--authors)
    (define-key map "\M-T" #'calibredb-set-metadata--title)
    (define-key map "\M-c" #'calibredb-set-metadata--comments)
    map)
  "Keymap for `calibredb-search-mode'.")

#+end_src
** nov-el
#+begin_src elisp
(add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
#+end_src
** evil-mc
#+begin_src elisp
(evil-define-key 'normal 'global
  (kbd "C-ñ") #'evil-mc-pause-cursors
  (kbd "ñ")   #'evil-mc-make-cursor-here)
#+end_src
** citar
#+begin_src elisp
(defvar citar-biblio-dir (concat lcp/org-support-directory "bib/"))

(use-package! citar
  :bind (("C-c b" . citar-insert-citation)
         :map minibuffer-local-map
         ("M-b" . citar-insert-preset))
  :custom
  (citar-citeproc-csl-styles-dir (concat citar-biblio-dir "styles/"))
  (org-cite-csl-styles-dir citar-citeproc-csl-styles-dir)
  (citar-org-roam-note-title-template "${author editor} :: ${title}\n");#+filetags: :__draft__:")
  (citar-org-roam-subdir "references")
  (citar-bibliography (concat citar-biblio-dir "biblio.bib")));(directory-files citar-biblio-dir t directory-files-no-dot-files-regexp)))

(setq org-cite-global-bibliography `(,(concat citar-biblio-dir "biblio.bib")))

(use-package citar-org
  :after oc
  :custom
  (org-cite-insert-processor 'citar)
  (org-cite-follow-processor 'citar)
  (org-cite-activate-processor 'citar))

(use-package citar-org-roam
  :after (citar org-roam)
  :config (citar-org-roam-mode))
#+end_src

#+RESULTS:
: t

** svelte-mode
SGML mode, which svelte-mode is derived from, automatically closes your current tag for you with the C-c C-e shortcut (sgml-close-tag). This however does not work for components that share their name with unclosed html tags, like for example the Link component from svelte-routing. SGML mode by default checks whether tags are supposed to be closed or not by comparing tag names with lists of element names case-insensitively, so <Link> is equivalent to <link>. The following configuration snippet makes the comparison of tag names by SGML mode case-sensitive when svelte-mode is the current active major-mode in the buffer. Just add it to your config file and you're good to go. (explanation copied from [[https://github.com/leafOfTree/svelte-mode][its repo]])
#+begin_src elisp
(defun svelte-mode-sgml-empty-tag-p-advice (old-function tag-name)
  "Advice function intended to wrap around `sgml-empty-tag-p

Makes case significant when checking whether tags need to be
closed or not, to not confuse elements with Svelte components."
  (if (eq major-mode 'svelte-mode)
      (assoc-string tag-name sgml-empty-tags)
    (funcall old-function tag-name)))

(defun svelte-mode-sgml-unclosed-tag-p-advice (old-function tag-name)
  "Advice function intended to wrap around `sgml-unclosed-tag-p

Makes case significant when checking whether tags need to be
closed or not, to not confuse elements with Svelte components."
  (if (eq major-mode 'svelte-mode)
      (assoc-string tag-name sgml-unclosed-tags)
    (funcall old-function tag-name)))

(advice-add 'sgml-empty-tag-p :around 'svelte-mode-sgml-empty-tag-p-advice)
(advice-add 'sgml-unclosed-tag-p :around 'svelte-mode-sgml-unclosed-tag-p-advice)
#+end_src
** dirvish
Interesting complement to dired
#+begin_src elisp
(use-package! dirvish
  :ensure t
  :init
  ;; Let Dirvish take over Dired globally
  (dirvish-override-dired-mode))
#+end_src
** plantuml
#+begin_src elisp
;; (setq plantuml-jar-path "~/.plantuml/plantuml.jar")
;; (setq plantuml-default-exec-mode 'jar)
;; (setq org-plantuml-jar-path
;;       (expand-file-name "/home/luis/.plantuml/plantuml.jar"))
;; (add-to-list 'org-src-lang-modes '("plantuml" . plantuml))
#+end_src
** r
#+begin_src elisp
;(require 'ess-site)
#+end_src
