.config/doom/packages.el

(package! lsp-pyright
  :recipe (:host github :repo "emacs-lsp/lsp-pyright"))
(package! lsp-haskell)
(package! lsp-dart)

(package! tidal)
(package! gnuplot-mode)
(package! bqn-mode)
(package! load-theme-buffer-local)
(package! calibredb)
(package! visual-regexp)
(package! chess)
(package! speed-type)
(package! nov)
(package! doct)
(package! hledger-mode)
(package! svelte-mode)
(package! svelte-mode)
(package! dirvish)
(package! all-the-icons)
(package! riscv-mode)
(package! anki-editor)
(package! outshine
  :recipe (:host github :repo "alphapapa/outshine"))
(package! sparql
  :recipe (:host github :repo "ljos/sparql-mode"))
