.config/doom/config.org
** cfwl
#+begin_src
(setq byte-compile-warnings '((cl-functions)))
(require 'cl-lib)
(require 'calfw-cal)
(require 'calfw-ical)
;(require 'calfw-howm)
(require 'calfw-org)

(defun lcp/open-calendar ()
  (interactive)
  (cfw:open-calendar-buffer
   :contents-sources
   (list
    (cfw:org-create-source)  ; orgmode source
    ;(cfw:howm-create-source "Blue")  ; howm source
    (cfw:cal-create-source "Orange") ; diary source
    ;(cfw:ical-create-source "Moon" "~/moon.ics" "Gray")  ; ICS source1
    ;(cfw:ical-create-source "gcal" "https://..../basic.ics" "IndianRed") ; google calendar ICS
   )))
#+end_src
#+begin_src
(custom-set-faces
 '(cfw:face-title ((t (:foreground "#f0dfaf" :weight bold :height 2.0 :inherit variable-pitch))))
 '(cfw:face-header ((t (:foreground "#d0bf8f" :weight bold))))
 '(cfw:face-sunday ((t :foreground "#cc9393" :background "grey10" :weight bold)))
 '(cfw:face-saturday ((t :foreground "#8cd0d3" :background "grey10" :weight bold)))
 '(cfw:face-holiday ((t :background "grey10" :foreground "#8c5353" :weight bold)))
 '(cfw:face-grid ((t :foreground "DarkGrey")))
 '(cfw:face-default-content ((t :foreground "#bfebbf")))
 '(cfw:face-periods ((t :foreground "cyan")))
 '(cfw:face-day-title ((t :background "grey10")))
 '(cfw:face-default-day ((t :weight bold :inherit cfw:face-day-title)))
 '(cfw:face-annotation ((t :foreground "RosyBrown" :inherit cfw:face-day-title)))
 '(cfw:face-disable ((t :foreground "DarkGray" :inherit cfw:face-day-title)))
 '(cfw:face-today-title ((t :background "#7f9f7f" :weight bold)))
 '(cfw:face-today ((t :background: "grey10" :weight bold)))
 '(cfw:face-select ((t :background "#2f2f2f")))
 '(cfw:face-toolbar ((t :foreground "Steelblue4" :background "Steelblue4")))
 '(cfw:face-toolbar-button-off ((t :foreground "Gray10" :weight bold)))
 '(cfw:face-toolbar-button-on ((t :foreground "Gray50" :weight bold))))
#+end_src
#+begin_src
;; Default setting
;; (setq cfw:fchar-junction ?+
;;       cfw:fchar-vertical-line ?|
;;       cfw:fchar-horizontal-line ?-
;;       cfw:fchar-left-junction ?+
;;       cfw:fchar-right-junction ?+
;;       cfw:fchar-top-junction ?+
;;       cfw:fchar-top-left-corner ?+
;;       cfw:fchar-top-right-corner ?+ )
;; Unicode characters
(setq cfw:fchar-junction ?╋
      cfw:fchar-vertical-line ?┃
      cfw:fchar-horizontal-line ?━
      cfw:fchar-left-junction ?┣
      cfw:fchar-right-junction ?┫
      cfw:fchar-top-junction ?┯
      cfw:fchar-top-left-corner ?┏
      cfw:fchar-top-right-corner ?┓)
#+end_src

** holidays
*** General
#+begin_src elisp
(setq holiday-general-holidays
      '((holiday-fixed 1 1 "New Year's Day")
        (holiday-fixed 2 14 "Valentine's Day")
        (holiday-fixed 10 31 "Halloween")
        ;; Yankis
        (holiday-float 11 4 4 "Thanksgiving")
        (holiday-fixed 4 1 "April Fools' Day")
        (holiday-float 1 1 3 "Martin Luther King Day")
        (holiday-float 5 1 -1 "Memorial Day")
        (holiday-fixed 6 14 "Flag Day")
        (holiday-fixed 7 4 "Independence Day")
        (holiday-float 9 1 1 "Labor Day")
        (holiday-fixed 3 17 "St. Patrick's Day")
        ))
;; USEFUL when I go to USA
;; (holiday-fixed 1 1 "New Year's Day")
;;  (holiday-fixed 2 2 "Groundhog Day")
;;  (holiday-fixed 2 14 "Valentine's Day")
;;  (holiday-float 2 1 3 "President's Day")
;;  (holiday-float 5 0 2 "Mother's Day")
;;  (holiday-float 6 0 3 "Father's Day")
;;  (holiday-float 10 1 2 "Columbus Day")
;;  (holiday-fixed 11 11 "Veteran's Day")
#+end_src

*** Local (Madrid + Spain)
#+begin_src elisp
(setq holiday-other-holidays
      '((holiday-fixed 5 1 "Día del Trabajo")
        (holiday-fixed 3 19 "Día del Padre")
        (holiday-float 5 0 1 "Día de la Madre")
        (holiday-fixed 5 2 "Día de la Independencia en Madrid")
        (holiday-fixed 5 15 "San Isidro")
        (holiday-fixed 10 12 "Día de la Hispanidad")
        (holiday-fixed 11 1 "Día de Todos los Santos")
        (holiday-fixed 12 6 "Día de la Constitución Española")
        (holiday-fixed 12 8 "Inmaculada Concepción")
        ))
#+end_src
** pylint
#+begin_src elisp
;; Configure Flymake for Python
(setq flymake-allowed-file-name-masks nil)
(when (load "flymake" t)
  (defun flymake-pylint-init ()
    (let* ((temp-file (flymake-init-create-temp-buffer-copy
                       'flymake-create-temp-inplace))
           (local-file (file-relative-name
                        temp-file
                        (file-name-directory buffer-file-name))))
      (list "epylint" (list local-file))))

  (add-to-list 'flymake-allowed-file-name-masks
               '("\\.py\\'" flymake-pylint-init)))
#+end_src

** Transparency
#+begin_src elisp
;;(set-frame-parameter (selected-frame) 'alpha '(<active> . <inactive>))
;;(set-frame-parameter (selected-frame) 'alpha <both>)
;;(set-frame-parameter (selected-frame) 'alpha '(95 . 85))
;;(add-to-list 'default-frame-alist '(alpha . (100 . 75)))
;;(doom/set-frame-opacity 95)
#+end_src
** bqn
#+begin_src elisp
(use-package! bqn-mode
  :bind (:map bqn-mode-map
              ("C-c C-c" . bqn-comint-eval-buffer)))
#+end_src

** wakatime
#+begin_src elisp
;(global-wakatime-mode)
;(setq wakatime-api-key "waka_7c8efaf8-c924-417d-bb91-281692336d98")
#+end_src
** yas
#+begin_src elisp
(add-to-list 'yas-snippet-dirs (concat doom-user-dir "snippets/"))
#+end_src

#+RESULTS:
| /home/luis/.config/doom/snippets/ | +snippets-dir | doom-snippets-dir | +file-templates-dir |
** prettify-symbols
#+begin_src elisp
(defun org-icons ()
   "Beautify org mode keywords."
   (setq prettify-symbols-alist
         '(
           ("\\to" . ?➔)))
   (prettify-symbols-mode))
(add-hook 'org-mode-hook 'org-icons)
#+end_src

#+RESULTS:
| er/add-org-mode-expansions | org-icons | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | laas-mode | org-fragtog-mode | org-ref-org-menu | (closure ((hook . org-mode-hook)) (&rest _) (progn (let ((tail '(after-change-major-mode-hook))) (while tail (let ((hook (car tail))) (let ((tail (list #'(lambda (&rest _) (if (derived-mode-p 'org-mode) (progn (setq tab-width 8))))))) (while tail (let ((func (car tail))) (add-hook hook func nil t) (setq tail (cdr tail))))) (setq tail (cdr tail)))))) (add-hook 'save-place-after-find-file-hook #'+org-make-last-point-visible-h nil t)) | +lookup--init-org-mode-handlers-h | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | doom-disable-show-paren-mode-h | doom-disable-show-trailing-whitespace-h | evil-org-mode | org-eldoc-load | toc-org-enable | embrace-org-mode-hook |
** sparql-mode
#+begin_src elisp
(add-to-list 'auto-mode-alist '("\\.sparql$" . sparql-mode))
(add-to-list 'auto-mode-alist '("\\.rq$" . sparql-mode))
#+end_src
* DnD
